#include <unistd.h>
#include <time.h>
#include <stdio.h>


// Буфер для зберігання блоку даних, прочитаного зі стандартного потоку введення
char buf[4096];

int len = 0; // кількість байтів, які були фактично прочитані у буфер
int pos = 0; // текущя позиція читання всередині буфера


// Повертає наступний символ із буфера.
// Якщо всі дані з буфера вже використані, функція завантажує новий блок даних за допомогою read().
int readBuffer(char* c) {

    // Якщо поточний буфер повністю прочитаний, завантажуємо наступні дані зі стандартного потоку введення
    if(len == pos) {
        len = read(0, buf, sizeof(buf));
        pos = 0;
    }

    // Якщо read() не прочитав даних, вважаємо, що потік завершився
    if(len <= 0)
        return 0;

    // Записуємо поточний символ буфера за адресою c і переходимо до наступної позиції
    *c = buf[pos++];

    return 1;
}


// Зчитує ціле число з потоку.
// Символи числа беруться не напряму через read(), а послідовно з вхідного буфера через read_buf().
void readInt(int* a) {
    int r = 0;
    char c;

    while(readBuffer(&c) && c >= '0' && c <= '9') { // // Поки зчитуються цифри, формуємо з них ціле число
        r = r * 10 + (c - 48);
    }

    // Записуємо отримане значення у передану змінну
    *a = r;
}


// Власна функція введення.
// Аналізує формат і залежно від специфікатора викликає відповідну функцію читання даних.
void input(char* f, void* a) {
    int i = 0;

    while(f[i] != '\0') { // Переглядаємо символи форматного рядка
        if(f[i] == '%') {// Якщо знайдено символ %, перевіряємо наступний символ
            ++i;

            if(f[i] == 'd') {
                readInt((int*) a);
            }
        }

        ++i;
    }
}


int main() { 
    int time1 = time(NULL); // Запам'ятовуємо час перед початком читання даних

    for(int i = 0; i < 10000000; ++i) { // Зчитуємо 10 000 000 цілих чисел за допомогою власної функції input()
        int a;
        input("%d", &a);
    }

    // Запам'ятовуємо час після завершення читання
    int time2 = time(NULL);

    int timeResult = time2 - time1; // Обчислюємо загальний час виконання

    printf("Time = %d\n", timeResult);

    return 0;
}